/*
 * =====================================================================================
 *
 *       Filename:  1231.c
 *
 *    Description:  
 *    给定K个整数的序列{ N1, N2, ..., NK }，其任意连续子序列可表示为{ Ni, Ni+1, ..., 
 *    Nj }，其中 1 <= i <= j <= K。最大连续子序列是所有连续子序列中元素和最大的一个， 
 *    例如给定序列{ -2, 11, -4, 13, -5, -2 }，其最大连续子序列为{ 11, -4, 13 }，最大和 
 *    为20。 
 *    在今年的数据结构考卷中，要求编写程序得到最大和，现在增加一个要求，即还需要输出该 
 *    子序列的第一个和最后一个元素。
 *    Input
 *    测试输入包含若干测试用例，每个测试用例占2行，第1行给出正整数K( < 10000 )，第2行给出K个整数，中间用空格分隔。当K为0时，输入结束，该用例不被处理。
 *    Output
 *    对每个测试用例，在1行里输出最大和、最大连续子序列的第一个和最后一个元 
 *    素，中间用空格分隔。如果最大连续子序列不唯一，则输出序号i和j最小的那个（如输入样例的第2、3组）。若所有K个元素都是负数，则定义其最大和为0，输出整个序列的首尾元素。 
 *    Sample Input
 *    6
 *    -2 11 -4 13 -5 -2
 *    10
 *    -10 1 2 3 4 -5 -23 3 7 -21
 *    6
 *    5 -8 3 2 5 0
 *    1
 *    10
 *    3
 *    -1 -5 -2
 *    3
 *    -1 0 -2
 *    0
 *    Sample Output
 *    20 11 13
 *    10 1 4
 *    10 3 5
 *    10 10 10
 *    0 -1 -2
 *    0 0 0
 *
 *        Created:  08/07/2015 09:48:00
 *       Compiler:  gcc
 *
 *         Author:  Jackie Kuo (http://jackiekuo.com), j.kuo2012@gmail.com
 *
 * =====================================================================================
 */

#include <stdio.h>
int main(void) {
	int k, i, a[10002], sum, max, tmp, begin, end;
	while (scanf("%d", &k) != EOF) {
		if (!k) {
			break;
		}
		for (i = 0; i < k; ++i) {
			scanf("%d", &a[i]);
		}
		sum = 0;
		max = begin = end = tmp = a[0];
		for (i = 0; i < k; ++i) {
			sum += a[i];
			if (sum < 0) {
				tmp = a[i + 1];
				sum = 0;
			} else if (sum > max) {
				begin = tmp;
				end = a[i];
				max = sum;
			}
		}
		if (max >= 0) {
			printf("%d %d %d\n", max, begin, end);
		} else {
			printf("%d %d %d\n", 0, a[0], a[k - 1]);
		}
	}
	return 0;
}
